app/controllers/dashboard_controller.rb

  def index
    @purchase_orders = PurchaseOrder.all#.where(owner: true)
    @products = Product.all.where(owner: true)
---
SELECT "products".* FROM "products" WHERE "products"."owner" = ?  [["owner", true]]