app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."sku" = ? LIMIT ?  [["sku", 1], ["LIMIT", 1]]
---
  def buy
    sku = "2" #"Huevo"
    p = Product.find(sku)